{
  "title": "Methods",
  "content": "Navigate Language Fundamentals topic: (vde)\n\n Statements\n Conditional blocks\n Loop blocks\n Boolean expressions\n Variables\n Primitive Types\n Arithmetic expressions\n Literals\n Methods\n String\n Objects\n Packages\n Arrays\n Mathematical functions\n Large numbers\n Random numbers\n Unicode\n Comments\n Keywords\n Coding conventionsMethods are how we communicate with objects. When we invoke or call a method we are asking the object to carry out a task. We can say methods implement the behaviour of objects. For each method we need to give a name, we need to define its input parameters and we need to define its return type. We also need to set its visibility (private, protected or public). If the method throws a checked exception, that needs to be declared as well. It is called a method definition. The syntax of method definition is:1 MyClass {\n2   ...\n3   public ReturnType methodName(ParamOneType parameter1, ParamTwoType parameter2) {\n4       ...\n5       return returnType;\n6   }\n7   ...\n8 }We can declare that the method does not return anything using the void Java keyword. For example:Code section 3.67: Method without returned data.\n\n\n1 private void methodName(String parameter1, String parameter2) {\n2   ...\n3   return;\n4 }When the method returns nothing, the return keyword at the end of the method is optional. When the execution flow reaches the return keyword, the method execution is stopped and the execution flow returns to the caller method. The return keyword can be used anywhere in the method as long as there is a way to execute the instructions below:Code section 3.68: return keyword location.\n\n\n 1 private void aMethod(int a, int b) {\n 2   int c = 0;\n 3   if (a > 0) {\n 4     c = a;\n 5     return;\n 6   }\n 7   int c = c + b;\n 8   return;\n 9   int c = c * 2;\n10 }In the code section 3.68, the return keyword at line 5 is well placed because the instructions below can be reached when a is negative or equal to 0. However, the return keyword at line 8 is badly placed because the instructions below can't be reached.Test your knowledge\n\nQuestion 3.9: Consider the following code:\n\n\n\nQuestion 3.9: Compiler error.\n\n\n1 private int myMethod(int a, int b, boolean c) {\n2   b = b + 2;\n3   if (a > 0) {\n4     a = a + b;\n5     return a;\n6   } else {\n7     a = 0;\n8   }\n9 }\n\n\n\n\nThe code above will return a compiler error. Why?\n\nAnswer\n\n\n\n\nAnswer 3.9: Compiler error.\n\n\n1 private int myMethod(int a, int b, boolean c) {\n2   b = b + 2;\n3   if (a > 0) {\n4     a = a + b;\n5     return a;\n6   } else {\n7     a = 0;\n8   }\n9 }\n\n\n\n\nThe method is supposed to return a int but when a is negative or equal to 0, it returns nothing."
}