{
  "title": "Comparing Strings[edit]",
  "content": "Comparing strings is not as easy as it may first seem. Be aware of what you are doing when comparing String's using ==:Code section 3.89: Dangerous comparison.\n\n\n1 String greeting = \"Hello World!\";\n2 if (greeting == \"Hello World!\") {\n3     System.out.println(\"Match found.\");\n4 }\n\n\n\n\n\n\n\n\n\nOutput for Code section 3.89\n\nMatch found.The difference between the above and below code is that the above code checks to see if the String's are the same objects in memory which they are. This is as a result of the fact that String's are stored in a place in memory called the String Constant Pool. If the new keyword is not explicitly used when creating the String it checks to see if it already exists in the Pool and uses the existing one. If it does not exist, a new Object is created. This is what allows Strings to be immutable in Java. To test for equality, use the equals(Object) method inherited by every class and defined by String to return true if and only if the object passed in is a String contains the exact same data:Code section 3.90: Right comparison.\n\n\n1 String greeting = \"Hello World!\";\n2 if (greeting.equals(\"Hello World!\")) {\n3     System.out.println(\"Match found.\");\n4 }\n\n\n\n\n\n\n\n\n\nOutput for Code section 3.90\n\nMatch found.Remember that the comparison is case sensitive.Code section 3.91: Comparison with lowercase.\n\n\n1 String greeting = \"Hello World!\";\n2 if (greeting.equals(\"hello world!\")) {\n3     System.out.println(\"Match found.\");\n4 }\n\n\n\n\n\n\n\n\n\nOutput for Code section 3.91To order String objects, use the compareTo() method, which can be accessed wherever we use a String datatype. The compareTo() method returns a negative, zero, or positive number if the parameter is less than, equal to, or greater than the object on which it is called. Let's take a look at an example:Code section 3.92: Order.\n\n\n1 String person1 = \"Peter\";\n2 String person2 = \"John\";\n3 if (person1.compareTo(person2) > 0) {\n4     // Badly ordered\n5     String temp = person1;\n6     person1 = person2;\n7     person2 = temp;\n8 }The code section 3.92 is comparing the String variable person1 to person2. If person1 is different even in the slightest manner, we will get a value above or below 0 depending on the exact difference. The result is negative if this String object lexicographically precedes the argument string. The result is positive if this String object lexicographically follows the argument string. Take a look at the Java API for more details."
}