{
  "title": "Autoboxing/unboxing[edit]",
  "content": "Autoboxing and unboxing, language features since Java 1.5, make the programmer's life much easier when it comes to working with the primitive wrapper types. Consider this code fragment:Code section 3.85: Traditional object creation.\n\n\n1 int age = 23;\n2 Integer ageObject = new Integer(age);Primitive wrapper objects were Java's way of allowing one to treat primitive data types as though they were objects. Consequently, one was expected to wrap one's primitive data type with the corresponding primitive wrapper object, as shown above.Since Java 1.5, one may write as below and the compiler will automatically create the wrap object. The extra step of wrapping the primitive is no longer required. It has been automatically boxed up on your behalf:Code section 3.86: Autoboxing.\n\n\n1 int age = 23;\n2 Integer ageObject = age;Keep in mind that the compiler still creates the missing wrapper code, so one doesn't really gain anything performance-wise. Consider this feature a programmer convenience, not a performance booster.Each primitive type has a class wrapper:Primitive type\nClass wrapper\n\n\nbyte\njava.lang.Byte\n\n\nchar\njava.lang.Character\n\n\nshort\njava.lang.Short\n\n\nint\njava.lang.Integer\n\n\nlong\njava.lang.Long\n\n\nfloat\njava.lang.Float\n\n\ndouble\njava.lang.Double\n\n\nboolean\njava.lang.Boolean\n\n\nvoid\njava.lang.VoidUnboxing uses the same process in reverse. Study the following code for a moment. The if statement requires a boolean primitive value, yet it was given a Boolean wrapper object. No problem! Java 1.5 will automatically unbox this.Code section 3.87: Unboxing.\n\n\n1 Boolean canMove = new Boolean(true);\n2  \n3 if (canMove) {\n4   System.out.println(\"This code is legal in Java 1.5\");\n5 }Test your knowledge\n\nQuestion 3.11: Consider the following code:\n\n\n\nQuestion 3.11: Autoboxing/unboxing.\n\n\n5 Integer a = 10;\n6 Integer b = a + 2;\n7 System.out.println(b);\n\n\n\n\nHow many autoboxings and unboxings are there in this code?\n\nAnswer\n\n\n\n\nAnswer 3.11: Autoboxing/unboxing.\n\n\n1 Integer a = 10;\n2 Integer b = a + 2;\n3 System.out.println(b);\n\n\n\n\n3\n\n1 autoboxing at line 1 to assign.\n1 unboxing at line 2 to do the addition.\n1 autoboxing at line 2 to assign.\nNo autoboxing nor unboxing at line 3 as println() supports the Integer class as parameter."
}