{
  "title": "Fundamentals[edit]",
  "content": "Every class in Java can be composed of the following elements:fields, member variables or instance variables  Fields are variables that hold data specific to each object. For example, an employee might have an ID number. There is one field for each object of a class.\nmember methods or instance methods  Member methods perform operations on an object. For example, an employee might have a method to issue his paycheck or to access his name.\nstatic fields or class fields  Static fields are common to any object of the same class. For example, a static field within the Employee class could keep track of the last ID number issued. Each static field exists only once in the class, regardless of how many objects are created for that class.\nstatic methods or class methods  Static methods are methods that do not affect a specific object.\ninner classes  Sometimes it is useful to contain a class within another one if it is useless outside of the class or should not be accessed outside the class.\nConstructors  A special method that generates a new object.\nParameterized types  Since 1.5, parameterized types can be assigned to a class during definition. The parameterized types will be substituted with the types specified at the class's instantiation. It is done by the compiler. It is similar to the C language macro '#define' statement, where a preprocessor evaluates the macros.Code listing 4.1: Employee.java\n\n\n 1 public class Employee {              // This defines the Employee class.\n 2                                      // The public modifier indicates that\n 3                                      // it can be accessed by any other class\n 4 \n 5     private static int nextID;       // Define a static field. Only one copy of this will exist,\n 6                                      // no matter how many Employees are created.\n 7 \n 8     private int myID;                // Define fields that will be stored  \n 9     private String myName;           // for each Employee. The private modifier indicates that\n10                                      // only code inside the Employee class can access it.\n11  \n12     public Employee(String name) {   // This is a constructor. You can pass a name to the constructor\n13                                      // and it will give you a newly created Employee object.\n14         myName = name;\n15         myID = nextID;               // Automatically assign an ID to the object\n16         nextID++;                    // Increment the ID counter\n17     }\n18  \n19     public String getName() {        // This is a member method that returns the\n20                                      // Employee object's name.\n21         return myName;               // Note how it can access the private field myName.\n22     }\n23  \n24     public int getID() {             // This is another member method.\n25    \n26         return myID;  \n27     }\n28  \n29     public static int getNextID() {  // This is a static method that returns the next ID\n30                                      // that will be assigned if another Employee is created.\n31         return nextID;\n32     }\n33 }The following Java code would produce this output:Code listing 4.2: EmployeeList.java\n\n\n 1 public class EmployeeList {\n 2     public static void main(String[] args) {\n 3 \n 4         System.out.println(Employee.getNextID());\n 5  \n 6         Employee a = new Employee(\"John Doe\");\n 7         Employee b = new Employee(\"Jane Smith\");\n 8         Employee c = new Employee(\"Sally Brown\");\n 9  \n10         System.out.println(Employee.getNextID());\n11  \n12         System.out.println(a.getID() + \": \" + a.getName());\n13         System.out.println(b.getID() + \": \" + b.getName());\n14         System.out.println(c.getID() + \": \" + c.getName());\n15     }\n16 }\n\n\n\n\n\n\n\n\n\nConsole for Code listing 4.2\n\n0\n3\n0: John Doe\n1: Jane Smith\n2: Sally Brown"
}