{
  "title": "Constructors[edit]",
  "content": "A constructor is called to initialize an object immediately after the object has been allocated:Code listing 4.3: Cheese.java\n\n\n1 public class Cheese {\n2   // This is a constructor\n3   public Cheese() {\n4     System.out.println(\"Construct an instance\");\n5   }\n6 }Typically, a constructor is invoked using the new keyword:Code section 4.1: A constructor call.\n\n\n1 Cheese cheese = new Cheese();The constructor syntax is close to the method syntax. However, the constructor has the same name as the name of the class (with the same case) and the constructor has no return type. The second point is the most important difference as a method can also have the same name as the class, which is not recommended:Code listing 4.4: Cheese.java\n\n\n1 public class Cheese {\n2   // This is a method with the same name as the class\n3   public void Cheese() {\n4     System.out.println(\"A method execution.\");\n5   }\n6 }The returned object is always a valid, meaningful object, as opposed to relying on a separate initialization method. A constructor cannot be abstract, final, native, static, strictfp nor synchronized. However, a constructor, like methods, can be overloaded and take parameters.Code listing 4.5: Cheese.java\n\n\n 1 public class Cheese {\n 2      // This is a constructor\n 3      public Cheese() {\n 4           doStuff();\n 5      }\n 6 \n 7      // This is another constructor\n 8      public Cheese(int weight) {\n 9           doStuff();\n10      }\n11 \n12      // This is yet another constructor\n13      public Cheese(String type, int weight) {\n14           doStuff();\n15      }\n16 }By convention, a constructor that accepts an object of its own type as a parameter and copies the data members is called a copy constructor. One interesting feature of constructors is that if and only if you do not specify a constructor in your class, the compiler will create one for you. This default constructor, if written out would look like:Code listing 4.6: Cheese.java\n\n\n1 public class Cheese {\n2      public Cheese() {\n3            super();\n4      }\n5 }The super() command calls the constructor of the superclass. If there is no explicit call to super(...) or this(...), then the default superclass constructor super(); is called before the body of the constructor is executed. That said, there are instances where you need to add in the call manually. For example, if you write even one constructor, no matter what parameters it takes, the compiler will not add a default constructor. The code listing 4.8 results in a runtime error:Code listing 4.7: Cheese.java\n\n\n1 public class Cheese {\n2      public Cheese(int weight, String type) {\n3           doStuff();\n4      }\n5 }Code listing 4.8: Mouse.java\n\n\n1 public class Mouse {\n2      public void eatCheese() {\n3              Cheese c = new Cheese(); // Oops, compile time error!\n4      }\n5 }This is something to keep in mind when extending existing classes. Either make a default constructor, or make sure every class that inherits your class uses the correct constructor."
}