{
  "title": "Quick compilation procedure[edit]",
  "content": "To execute your first Java program, follow the instructions below:1.\nProceed only if you have successfully installed and configured your system for Java as discussed here.\n\n\n2.\nOpen your preferred text editor  this is the editor you set while installing the Java platform.\n\n\n\nFor example, Notepad or Notepad++ on Windows; Gedit, Kate or SciTE on Linux; or, XCode on Mac OS, etc.\n\n\n3.\nWrite the following lines of code in a new text document:\n\n\n\nCode listing 2.5: HelloWorld.java\n\n\npublic class HelloWorld {\n  public static void main(String[] args) {\n    System.out.println(\"Hello World!\");\n  }\n}\n\n\n\n\n\n\n\n4.\nSave the file as HelloWorld.java  the name of your file should be the same as the name of your class definition and followed by the .java extension. This name is case-sensitive, which means you need to capitalize the precise letters that were capitalized in the name for the class definition.\n\n\n5.\nNext, open your preferred command-line application.\n\n\n\nFor example, Command Prompt on Windows; and, Terminal on Linux and Mac OS.\n\n\n6.\nIn your command-line application, navigate to the directory where you just created your file. If you do not know how to do this, consider reading through our crash courses for command-line applications for Windows or Linux.\n\n\n7.\nCompile the Java source file using the following command which you can copy and paste in if you want:\n\n\n\nCompilation\n\njavac HelloWorld.java\n\n\n\n\n\n\nIf you obtain an error message like error: cannot read: HelloWorld.java 1 error, your file is not in the current folder or it is badly spelled. Did you navigate to the program's location in the command prompt using the cd (change directory) command?\nIf you obtain another message ending by 1 error or ... errors, there may be a mistake in your code. Are you sure all words are spelled correctly and with the exact case as shown? Are there semicolons and brackets in the appropriate spot? Are you missing a quote? Usually, modern IDEs would try coloring the entire source as a quote in this case.\nIf your computer emits beeps, then you may have illegal characters in your HelloWorld.java.\nIf no HelloWorld.class file has been created in the same folder, then you've got an error. Are you launching the javac program correctly?\n\n\n\n\n\n\n8.\nOnce the compiler returns to the prompt, run the application using the following command:\n\n\n\nExecution\n\njava HelloWorld\n\n\n\n\n\n\nIf you obtain an error message like Exception in thread \"main\" java.lang.NoClassDefFoundError: HelloWorld, the HelloWorld.class file is not in the current folder or it is badly spelled.\nIf you obtain an error message like Exception in thread \"main\" java.lang.NoSuchMethodError: main, your source file may have been badly written.\n\n\n\n\n\n\n9.\nThe above command should result in your command-line application displaying the following result:\n\n\n\nOutput\n\nHello World!Ask for help if the program did not execute properly in the Discussion page for this chapter."
}