{
  "title": "Syntax[edit]",
  "content": "A documentation comment is framed by slash-star-star and star-slash (i.e. /** ... */). The documentation is in the HTML format.Code listing 8.1: Example.java\n\n\n1 /**\n2  *  A class to give an <b>example</b> of HTML documentation.\n3  */\n4 public class Example {\n5     /** ...Documentation of a member with the type integer named example... */\n6     public int example;\n7 }A documentation comment is placed just above the commented entity (class, constructor, method, field).In a documentation comment, the first part is a description text in the HTML format. The second part is a list of special attributes whose name starts with an at sign (@):Code section 8.1: Documentation comment.\n\n\n1 /**\n2  *  Get the sum of two integers.\n3  *  @param a The first integer number.\n4  *  @param b The second integer number.\n5  *  @return The value of the sum of the two given integers.\n6  */\n7 public int sum(int a, int b) {\n8     return a + b;\n9 }Get the sum of two integers.\nDescription of the sum method.\n@param a The first integer number.\nDescription attribute of the parameter a of the method.\n@param b The second integer number.\nDescription attribute of the parameter b of the method.\n@return The value of the sum of the two given integers.\nDescription attribute of the value returned by the method.Here is a non exhaustive list of special attributes:Attribute and syntax\nIn a comment of ...\nDescription\n\n\n@author author\nclass\nName of the author of the class.\n\n\n@version version\nclass\nVersion of the class.\n\n\n@deprecated description\nclass, constructor, method, field\nFlags the entity as deprecated (old version), describes why and by what replace it.\nIf the entity flagged as deprecated by this attribute is used, the compiler give a warning.\n\n\n\n@see reference\nclass, constructor, method, field\nAdd a link in the section \"See also\".\n\n\n@param id description\nconstructor and method\nDescribes the method parameter.\n\n\n@return description\nmethod\nDescribes the value returned by the method.\n\n\n@exception type description\nconstructor and method\nDescribes the reason of the throw of an exception of the specified type (throws clause).See also annotations since Java 5."
}