{
  "title": "Documentation[edit]",
  "content": "The JDK provides a tool named javadoc which allows to generate the documentation of the well commented classes. The javadoc command without argument give the complete syntax of the command.Example: for a class named Example defined in a package named org.wikibooks.en dans le fichier C:\\ProgJava\\org\\wikibooks\\en\\Example.java:Code listing 8.2: Example.java\n\n\n 1 package org.wikibooks.en;\n 2 \n 3 /**\n 4  *  An example class.\n 5  */\n 6 public class Example {\n 7     /**\n 8     Get the sum of two integers.\n 9     @param a The first integer number.\n10     @param b The second integer number.\n11     @return The value of the sum of the two given integers.\n12     */\n13     public int sum(int a, int b) {\n14         return a + b;\n15     }\n16 }The documentation can be generated in a specific folder (C:\\ProgDoc for example) with the following command:Command 8.1: Documentation generation\n\n$ javadoc -locale en_US -use -classpath C:\\ProgJava -sourcepath C:\\ProgJava -d C:\\ProgDoc org.wikibooks.enThe options of this command are described below:-locale en_US\nThe documentation in US English.\n-use\nCreate the pages about the use of the classes and the packages.\n-classpath C:\\ProgJava\nThe path of the compiled classes (*.class).\n-sourcepath C:\\ProgJava\nThe path of the source classes (*.java).\n-d C:\\ProgDoc\nThe path where the documentation must be generated.\norg.wikibooks.en\nThe name of the package to document. It is possible to specify several packages, or one or several class names to document only those ones.The description page of a package copy the description text from the file named package.html which should be placed in the given folder. In our example, we should document the package in the file C:\\ProgJava\\org\\wikibooks\\en\\package.html.Since Java 5[1], the package.html file can be replaced by a special Java file named package-info.java containing only the package declaration preceding by a documentation comment.Code listing 8.3: C:\\ProgJava\\org\\wikibooks\\en\\package-info.java\n\n\n1 /**\n2  * This fake package is used to illustrate the Java wikibook.\n3  * at <i>en.wikibooks.org</i>.\n4  */\n5 package org.wikibooks.en;"
}