{
  "title": "Input streams[edit]",
  "content": "Input streams acquire bytes for our programmed java application/program (e.g. a file, an array, a keyboard or monitor, etc.). InputStream is an abstract class that represents a source of byte data. It has a read() method, which returns the next byte in the stream and a close() method, which should be called by a program when that program is done with the stream. The read() method is overloaded, and can take a byte array to read to. It has a skip() method that can skip a number of bytes, and an available() method that a program can use to determine the number of bytes immediately available to be read, as not all the data is necessarily ready immediately. As an abstract class, it cannot be instantiated, but describes the general behavior of an input stream. A few examples of concrete subclasses would be ByteArrayInputStream, which reads from a byte array, and FileInputStream, which reads byte data from a file.In the following example, we print \"Hello world!\" on the screen several times. The number of times the message is printed is stored in a file named source.txt. This file should only contain a integer and should be placed in the same folder of the ConfiguredApplication class.Code listing 9.1: Example of input stream.\n\n\n 1 import java.io.File;\n 2 import java.io.FileInputStream;\n 3  \n 4 public class ConfiguredApplication {\n 5  \n 6   public static void main(String[] args) throws Exception {\n 7  \n 8     // Data reading\n 9     File file = new File(\"source.txt\");\n10     FileInputStream stream = new FileInputStream(file);\n11  \n12     StringBuffer buffer = new StringBuffer();\n13  \n14     int character = 0;\n15     while ((character = stream.read()) != -1) {\n16       buffer.append((char) character);\n17     }\n18  \n19     stream.close();\n20  \n21     // Data use\n22     Integer readInteger = Integer.parseInt(buffer.toString());\n23     for (int i = 0; i < readInteger ; i++) {\n24       System.out.println(\"Hello world!\");\n25     }\n26   }\n27 }The close() method is not always mandatory but can avoid some inter-process concurrency conflicts. However if it occurs before a read() or write() (in the same process) they return the warning Stream closed.The class start to identify the filename with a File object. The File object is used by an input stream as the source of the stream. We create a buffer and a character to prepare the data loading. The buffer will contain all the file content and the character will temporary contain each character present in the file, one after one. This is done while{}in the loop. Each iteration of the loop will copy a character from the stream to the buffer. The loop ends when no more character is present in the stream. Then we close the stream. The last part of the code use the data we have loaded in from the file. It is transformed into string and then into an integer (so the data must be an integer). If it works, the integer is used to determine the number of time we print \"Hello world!\" on the screen. No try/catch block has been defined for readability but the thrown exceptions should be caught.Let's try with the following source file:Code listing 9.2: source.txt\n4We should obtain this:Output for ConfiguredApplication\n\n$ java ConfiguredApplication\nHello world!\nHello world!\nHello world!\nHello world!If it shows a FileNotFoundException or an IOException, the source may not be placed in the right folder or its name is badly spelled.\nIf it shows a NumberFormatException, the content of the file may not be an integer.There is also Reader which is an abstract class that represents a source of character data. It is analogous to InputStream, except that it deals with characters instead of bytes (remember that Java uses Unicode, so that a character is 2 bytes, not one). Its methods are generally similar to those of InputStream. Concrete subclasses include classes like FileReader, which reads characters from files, and StringReader, which reads characters from strings. You can also convert an InputStream object to a Reader object with the InputStreamReader class, which can be \"wrapped around\" an InputStream object (by passing it as an argument in its constructor). It uses a character encoding scheme (which can be changed by the programmer) to translate a byte into a 16-bit Unicode character."
}