{
  "title": "Hmm, everything's perfect, but...[edit]",
  "content": "Sometimes people ask, after creating simple programs like the ones above, questions like:Why did I have to tell the Graphics instance the color before each drawing routine? Why can't it remember my choice for the outlines and for the fill colors? The answer is simpler than it seems. But, to fully understand it, we need to focus on one little thing called the Graphics Context. The graphics context is the information that adheres to a single instance of the Graphics class. Such an instance remembers only one color at a time and that is why we need to make sure the context knows of the color we need to use by using the setColor(Color) method.\nCan I manipulate the shapes, like tilt them and crop them? Hold your horses, cowboy! Everything is possible in Java, even tilting and cropping drawings. We will be focusing on these issues in a later section.\nIs making shapes like triangles, rhombuses and other complex ones tedious? Well, to be honest here, you need to go back to your dusty book cabinet and take out that High School Geometry book because we would be covering some geometry basics while dealing with such shapes. Why not read a wikibook on Geometry?Test your knowledge\n\nQuestion 9.3: Throughout the exercise listings above, we have been filling the shapes first and then drawing their outlines. What happens if we do it the other way around? Consider the code below.\n\n...\npublic void paint(Graphics graphics) {\n    graphics.setColor(Color.red);\n    graphics.drawRect(10, 10, 100, 100);\n    graphics.setColor(Color.yellow);\n    graphics.fillRect(10, 10, 100, 100);\n}\n...\n\n\nThe left and the top outlines disappear.\nThe right and the bottom outlines disappear.\nThe color for the outline becomes the color for the fill area.\nAll the outlines disappear.\n\n\nAnswer\n\nAll the outlines disappear.\n\n\nQuestion 9.4: What would drawLine(10, 100, 100, 100) give you?\n\nA horizontal line.\nA vertical line.\nA diagonal line.\n\n\nAnswer\n\nA horizontal line.If you have any questions regarding the content provided here, please feel free to comment in this page's discussion."
}