{
  "title": "Reshaping thought[edit]",
  "content": "The team started thinking of replacing C++ with a better version, a faster version, a responsive version. But the one thing they hadn't thought of, as of yet, was that the language they were aiming for had to be developed for an embedded system with limited resources. An embedded system is a computer system scaled to a minimalistic interface demanding only a few functions from its design. For such a system, C++ or any successor would seem too large as all the languages at the time demanded a larger footprint than what was desired. The team thus had to think in a different way to go about solving all these problems.Co-founder of Sun Microsystems, Bill Joy, envisioned a language combining the power of Mesa and C in a paper named Further he wrote for the engineers at Sun. Gathering ideas, Gosling began work on enhancing C++ and named it \"C++ ++ --\", a pun on the evolutionary structure of the language's name. The ++ and -- meant, putting in and taking out stuff. He soon abandoned the name and called it Oak[1] after the tree that stood outside his office.Table 1: Who's who of the Java technology[1]\nHas worked for GT (Green Team), FP (FirstPerson) and JP (Java Products Group)\n\nName\nGT\nFP\nJP\nDetails\n\n\nLisa Friendly\n\nYes\nYes\nFirstPerson employee and member of the Java Products Group\n\n\nJohn Gage\n\n\n\nScience Office (Director), Sun Microsystems\n\n\nJames Gosling\nYes\nYes\nYes\nLead engineer and key architect of the Java technology\n\n\nBill Joy\n\n\n\nCo-founder and VP, Sun Microsystems; Principal designer of the UC Berkeley, version of the UNIX OS\n\n\nJonni Kanerva\n\nYes\n\nJava Products Group employee, author of The Java FAQ1\n\n\nTim Lindholm\n\nYes\nYes\nFirstPerson employee and member Java Products Group\n\n\nScott McNealy\n\n\n\nChairman, President, and CEO of Sun Microsystems\n\n\nPatrick Naughton\nYes\nYes\n\nGreen Team member, FirstPerson co-founder\n\n\nGeorge Paolini\n\n\n\nCorporate Marketing (Director), Sun's Java Software Division\n\n\nKim Polese\n\nYes\n\nFirstPerson product marketing\n\n\nLisa Poulson\n\n\n\nOriginal director of public relations for Java technology (Burson-Marsteller)\n\n\nWayne Rosing\n\nYes\n\nFirstPerson President\n\n\nEric Schmidt\n\n\n\nFormer Sun Microsystems Chief Technology Officer\n\n\nMike Sheridan\nYes\n\n\nGreen Team member"
}