{
  "title": "Java Native Interface",
  "content": "Navigate Advanced topic: (vde)\n\n Networking\n Database programming\n Regular Expressions\n Libraries, extensions and frameworks\n 3D programming\n Java Native Interface\n Invoking C\n Byte CodeThe Java Native Interface (JNI) enables Java code running in a Java Virtual Machine (JVM) to call and to be called by native applications (programs specific to a hardware and operating system platform) and libraries written in other languages, such as C, C++ and assembly.JNI can be used:To implement or use features that are platform-specific.\nTo implement or use features that the standard Java class library does not support.\nTo enable an existing applicationwritten in another programming languageto be accessible to Java applications.\nTo let a native method use Java objects in the same way that Java code uses these objects (a native method can create Java objects and then inspect and use these objects to perform its tasks).\nTo let a native method inspect and use objects created by Java application code.\nFor time-critical calculations or operations like solving complicated mathematical equations (native code may be faster than JVM code).On the other hand, an application that relies on JNI loses the platform portability Java offers. So you will have to write a separate implementation of JNI code for each platform and have Java detect the operating system and load the correct one at runtime. Many of the standard library classes depend on JNI to provide functionality to the developer and the user (file I/O, sound capabilities...). Including performance- and platform-sensitive API implementations in the standard library allows all Java applications to access this functionality in a safe and platform-independent manner. Only applications and signed applets can invoke JNI. JNI should be used with caution. Subtle errors in the use of JNI can destabilize the entire JVM in ways that are very difficult to reproduce and debug. Error checking is a must or it has the potential to crash the JNI side and the JVM.This page will only explain how to call native code from JVM, not how to call JVM from native code."
}