{
  "title": "Versions[edit]",
  "content": "Unlike C and C++, Java's growth is pretty recent. Here, we'd quickly go through the development paths that Java took with age.Development of Java over the years. From version 1.0 to version 1.7, Java has displayed a steady growth.Initial Release (versions 1.0 and 1.1)[edit]Introduced in 1996 for the Solaris, Windows, Mac OS Classic and Linux, Java was initially released as the Java Development Kit 1.0 (JDK 1.0). This included the Java runtime (the virtual machine and the class libraries), and the development tools (e.g., the Java compiler). Later, Sun also provided a runtime-only package, called the Java Runtime Environment (JRE). The first name stuck, however, so usually people refer to a particular version of Java by its JDK version (e.g., JDK 1.0).Java 2 (version 1.2)[edit]Introduced in 1998 as a quick fix to the former versions, version 1.2 was the start of a new beginning for Java. The JDKs of version 1.2 and later versions are often called Java 2 as well. For example, the official name of JDK 1.4 is The Java(TM) 2 Platform, Standard Edition version 1.4.Major changes include:\n\nRewrite the event handling (add Event Listeners)\nChange Thread synchronizations\nIntroduction of the JIT-Just in time compilersKestrel (Java 1.3)[edit]Released in 8 May 2000. The most notable changes were:HotSpot JVM included (the HotSpot JVM was first released in April, 1999 for the J2SE 1.2 JVM)\nRMI was modified to support optional compatibility with CORBA\nJavaSound\nJava Naming and Directory Interface (JNDI) included in core libraries (previously available as an extension)\nJava Platform Debugger Architecture (JPDA)\nSynthetic proxy classesMerlin (Java 1.4)[edit]Released in 6 February 2002, Java 1.4 has improved programmer productivity by expanding language features and available APIs:Assertion\nRegular Expression\nXML processing\nCryptography and Secure Socket Layer (SSL)\nNon-blocking I/O (NIO)\nLoggingTiger (version 1.5.0; Java SE 5)[edit]Released in September 2004Major changes include:\n\nGenerics - Provides compile-time type safety for collections:and eliminates the drudgery of casting.\nAutoboxing/unboxing - Eliminates the drudgery of manual conversion between primitive types (such as int) and wrapper types (such as Integer).\nEnhanced for - Shorten the for loop with Collections use.\nStatic imports - Lets you import all the static part of a class.\nAnnotation/Metadata - Enabling tools to generate code and deployment descriptors from annotations in the source code. This leads to a \"declarative\" programming style where the programmer says what should be done and tools emit the code to do it. Annotations can be inspected through source parsing or by using the additional reflection APIs added in Java 5.\nJVM Improvements - Most of the run time library is now mapped into memory as a memory image, as opposed to being loaded from a series of class files. Large portion of the runtime libraries will now be shared among multiple JVM instances.Mustang (version 1.6.0; Java SE 6)[edit]Released on 11 December 2006.What's New in Java SE 6:Web Services - First-class support for writing XML web service client applications.Scripting - You can now mix in JavaScript technology source code, useful for prototyping. Also useful when you have teams with a variety of skill sets. More advanced developers can plug in their own scripting engines and mix their favorite scripting language in with Java code as they see fit.Database - No more need to find and configure your own JDBC database when developing a database application. Developers will also get the updated JDBC 4.0, a well-used API with many important improvements, such as special support for XML as an SQL datatype and better integration of Binary Large OBjects (BLOBs) and Character Large OBjects (CLOBs) into the APIs.More Desktop APIs - GUI developers get a large number of new tricks to play like the ever popular yet newly incorporated SwingWorker utility to help you with threading in GUI apps, JTable sorting and filtering, and a new facility for quick splash screens to quiet impatient users.Monitoring and Management - The really big deal here is that you don't need to do anything special to the startup to be able to attach on demand with any of the monitoring and management tools in the Java SE platform.Compiler Access - Really aimed at people who create tools for Java development and for frameworks like JavaServer Pages (JSP) or Personal Home Page construction kit (PHP) engines that need to generate a bunch of classes on demand, the compiler API opens up programmatic access to javac for in-process compilation of dynamically generated Java code. The compiler API is not directly intended for the everyday developer, but for those of you deafened by your screaming inner geek, roll up your sleeves and give it a try. And the rest of us will happily benefit from the tools and the improved Java frameworks that use this.Pluggable Annotations allows programmer to write annotation processor so that it can analyse your code semantically before javac compiles. For example, you could write an annotation processor that verifies whether your program obeys naming conventions.Desktop Deployment - At long last, Java SE 6 unifies the Java Plug-in technology and Java WebStart engines, which just makes sense. Installation of the Java WebStart application got a much needed makeover.Security - Java SE 6 has simplified the job of its security administrators by providing various new ways to access platform-native security services, such as native Public Key Infrastructure (PKI) and cryptographic services on Microsoft Windows for secure authentication and communication, Java Generic Security Services (Java GSS) and Kerberos services for authentication, and access to LDAP servers for authenticating users.The -lities: Quality, Compatibility, Stability - Bug fixes ...Dolphin (version 1.7.0; Java SE 7)[edit]Released on 28 July 2011.Feature additions for Java 7 include:JVM support for dynamic languages, following the prototyping work currently done on the Multi Language Virtual Machine\nCompressed 64-bit pointers Available in Java 6 with -XX:+UseCompressedOops\nSmall language changes (grouped under a project named Coin):Strings in switch\nAutomatic resource management in try-statement\nImproved type inference for generic instance creation\nSimplified varargs method declaration\nBinary integer literals\nAllowing underscores in numeric literals\nCatching multiple exception types and rethrowing exceptions with improved type checkingConcurrency utilities under JSR 166\nNew file I/O library to enhance platform independence and add support for metadata and symbolic links. The new packages are java.nio.file and java.nio.file.attribute\nLibrary-level support for Elliptic curve cryptography algorithms\nAn XRender pipeline for Java 2D, which improves handling of features specific to modern GPUs\nNew platform APIs for the graphics features originally planned for release in Java version 6u10\nEnhanced library-level support for new network protocols, including SCTP and Sockets Direct Protocol\nUpstream updates to XML and UnicodeLambda (Java's implementation of lambda functions), Jigsaw (Java's implementation of modules), and part of Coin were dropped from Java 7.Spider (version 1.8.0; Java SE 8)[edit]Java 8 was released on 18 March 2014, and included some features that were planned for Java 7 but later deferred.Work on features was organized in terms of JDK Enhancement Proposals (JEPs).JSR 335, JEP 126: Language-level support for lambda expressions (officially, lambda expressions; unofficially, closures) under Project Lambda which allow the addition of methods to interfaces without breaking existing implementations. There was an ongoing debate in the Java community on whether to add support for lambda expressions. Supporting lambda expressions also allows the performance of functional-style operations on streams of elements, such as MapReduce-inspired transformations on collections. Default methods allow an author of an API to add new methods to an interface without breaking the old code using it. Although it was not their primary intent, default methods also allow multiple inheritance of behavior (but not state).JSR 223, JEP 174: Project Nashorn, a JavaScript runtime which allows developers to embed JavaScript code within applications\nJSR 308, JEP 104: Annotation on Java Types\nUnsigned Integer Arithmetic\nJSR 337, JEP 120: Repeating annotations\nJSR 310, JEP 150: Date and Time API\nJEP 178: Statically-linked JNI libraries\nJEP 153: Launch JavaFX applications (direct launching of JavaFX application JARs)\nJEP 122: Remove the permanent generation"
}