{
  "title": "Loop blocks",
  "content": "Navigate Language Fundamentals topic: (vde)\n\n Statements\n Conditional blocks\n Loop blocks\n Boolean expressions\n Variables\n Primitive Types\n Arithmetic expressions\n Literals\n Methods\n String\n Objects\n Packages\n Arrays\n Mathematical functions\n Large numbers\n Random numbers\n Unicode\n Comments\n Keywords\n Coding conventionsLoops are a handy tool that enables programmers to do repetitive tasks with minimal effort. Say we want a program that can count from 1 to 10, we could write the following program.Code listing 3.4: Count.java\n\n\n 1 class Count {\n 2     public static void main(String[] args) {\n 3         System.out.println(\"1 \");\n 4         System.out.println(\"2 \");\n 5         System.out.println(\"3 \");\n 6         System.out.println(\"4 \");\n 7         System.out.println(\"5 \");\n 8         System.out.println(\"6 \");\n 9         System.out.println(\"7 \");\n10         System.out.println(\"8 \");\n11         System.out.println(\"9 \";\n12         System.out.println(\"10 \");\n13     }\n14 }\n\n\n\n\n\n\n\n\n\nOutput for code listing 3.4\n\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10The task will be completed just fine, the numbers 1 to 10 will be printed in the output, but there are a few problems with this solution:Flexibility: what if we wanted to change the start number or end number? We would have to go through and change them, adding extra lines of code where they're needed.\nScalability: 10 repeats are trivial, but what if we wanted 100 or even 1000 repeats? The number of lines of code needed would be overwhelming for a large number of iterations.\nMaintenance: where there is a large amount of code, one is more likely to make a mistake.\nFeature: the number of tasks is fixed and doesn't change at each execution.Using loops we can solve all these problems. Once you get you head around them they will be invaluable to solving many problems in programming.Open up your editing program and create a new file saved as Loop.java. Now type or copy the following code:Code listing 3.5: Loop.java\n\n\n1 class Loop {\n2     public static void main(String[] args) {\n3         int i;\n4         for (i = 1; i <= 10; i++) {\n5             System.out.println(i + \" \");\n6         }\n7     }\n8 }\n\n\n\n\n\n\n\n\n\nOutput for code listing 3.5\n\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10If we run the program, the same result is produced, but looking at the code, we immediately see the advantages of loops. Instead of executing 10 different lines of code, line 5 executes ten times. 10 lines of code have been reduced to just 4. Furthermore, we may change the number 10 to any number we like. Try it yourself, replace the 10 with your own number.While[edit]while loops are the simplest form of loop. The while loop repeats a block of code while the specified condition is true. Here is the structure of a while loop:while (boolean expression1) {\n\nstatement1\nstatement2\n...\nstatementn\n\n}The loop's condition is checked before each iteration of the loop. If the condition is false at the start of the loop, the loop will not be executed at all. The code section 3.28 sets in squareHigherThan200 the smallest integer whose square exceeds 200.Code section 3.28: The smallest integer whose square exceeds 200.\n\n\n1 int squareHigherThan200 = 0;\n2 \n3 while (squareHigherThan200 * squareHigherThan200 < 200) {\n4   squareHigherThan200 = squareHigherThan200 + 1;\n5 }If a loop's condition will never become false, such as if the true constant is used for the condition, said loop is known as an infinite loop. Such a loop will repeat indefinitely unless it is broken out of. Infinite loops can be used to perform tasks that need to be repeated over and over again without a definite stopping point, such as updating a graphics display.Do... while[edit]The do-while loop is functionally similar to the while loop, except the condition is evaluated AFTER the statement executes It is useful when we try to find a data that does the job by randomly browsing an amount of data.do {\n\nstatement1\nstatement2\n...\nstatementn\n\n} while (boolean expression1);For[edit]The for loop is a specialized while loop whose syntax is designed for easy iteration through a sequence of numbers. It consists of the keyword for followed by three extra statements enclosed in parentheses. The first statement is the variable declaration statement, which allows you to declare one or more integer variables. The second is the condition, which is checked the same way as the while loop. Last is the iteration statement, which is used to increment or decrement variables, though any statement is allowed.This is the structure of a for loop:for (variable declarations; condition; iteration statement) {\n\nstatement1\nstatement2\n...\nstatementn\n\n}To clarify how a for loop is used, here is an example:Code section 3.29: A for loop.\n\n\n1 for (int i = 1; i <= 10; i++) {\n2     System.out.println(i);\n3 }\n\n\n\n\n\n\n\n\n\nOutput for code listing 3.29\n\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10The for loop is like a template version of the while loop. The alternative code using a while loop would be as follows:Code section 3.30: An iteration using a while loop.\n\n\n1 int i = 1;\n2 while (i <= 10) {\n3   System.out.println(i);\n4   i++;\n5 }The code section 3.31 shows how to iterate with the for loop using multiple variables and the code section 3.32 shows how any of the parameters of a for loop can be skipped. Skip them all, and you have an infinitely repeating loop.Code section 3.31: The for loop using multiple variables.\n\n\n1 for (int i = 1, j = 10; i <= 10; i++, j--) {\n2   System.out.print(i + \" \");\n3   System.out.println(j);\n4 }\n\n\n\n\n\n\n\n\n\nCode section 3.32: The for loop without parameter.\n\n\n1 for (;;) {\n2   // Some code\n3 }For-each[edit]Arrays haven't been covered yet, but you'll want to know how to use the enhanced for loop, called the for-each loop. The for-each loop automatically iterates through a list or array and assigns the value of each index to a variable.To understand the structure of a for-each loop, look at the following example:Code section 3.33: A for-each loop.\n\n\n1 String[] sentence = {\"I\", \"am\", \"a\", \"Java\", \"program.\"};\n2 for (String word : sentence) {\n3     System.out.print(word + \" \");\n4 }\n\n\n\n\n\n\n\n\n\nOutput for code section 3.33\n\nI am a Java program.The example iterates through an array of words and prints them out like a sentence. What the loop does is iterate through sentence and assign the value of each index to word, then execute the code block.Here is the general contract of the for-each loop:for (variable declaration: array or list) {\n\nstatement1\nstatement2\n...\nstatementn\n\n}Make sure that the type of the array or list is assignable to the declared variable, or you will get a compilation error. Notice that the loop automatically exits after the last item in the collection has been examined in the statement block.Although the enhanced for loop can make code much clearer, it can't be used in some common situations.Only access. Elements can not be assigned to, eg, not to increment each element in a collection.\nOnly single structure. It's not possible to traverse two structures at once, eg, to compare two arrays.\nOnly single element. Use only for single element access, eg, not to compare successive elements.\nOnly forward. It's possible to iterate only forward by single steps.\nAt least Java 5. Don't use it if you need compatibility with versions before Java 5."
}