{
  "title": "Primitive Types",
  "content": "Navigate Language Fundamentals topic: (vde)\n\n Statements\n Conditional blocks\n Loop blocks\n Boolean expressions\n Variables\n Primitive Types\n Arithmetic expressions\n Literals\n Methods\n String\n Objects\n Packages\n Arrays\n Mathematical functions\n Large numbers\n Random numbers\n Unicode\n Comments\n Keywords\n Coding conventionsPrimitive types are the most basic data types available within the Java language. There are 8: boolean, byte, char, short, int, long, float and double. These types serve as the building blocks of data manipulation in Java. Such types serve only one purpose  containing pure, simple values of a kind. Because these data types are defined into the Java type system by default, they come with a number of operations predefined. You can not define a new operation for such primitive types. In the Java type system, there are three further categories of primitives:Numeric primitives: short, int, long, float and double. These primitive data types hold only numeric data. Operations associated with such data types are those of simple arithmetic (addition, subtraction, etc.) or of comparisons (is greater than, is equal to, etc.)\nTextual primitives: byte and char. These primitive data types hold characters (that can be Unicode alphabets or even numbers). Operations associated with such types are those of textual manipulation (comparing two words, joining characters to make words, etc.). However, byte and char can also support arithmetic operations.\nBoolean and null primitives: boolean and null.All the primitive types have a fixed size. Thus, the primitive types are limited to a range of values. A smaller primitive type (byte) can contain less values than a bigger one (long).Category\nTypes\nSize (bits)\nMinimum Value\nMaximum Value\nPrecision\nExample\n\n\nInteger\nbyte\n8\n-128\n127\nFrom +127 to -128\nbyte b = 65;\n\n\nchar\n16\n0\n216-1\nAll Unicode characters\nchar c = 'A';\nchar c = 65;\n\n\nshort\n16\n-215\n215-1\nFrom +32,767 to -32,768\nshort s = 65;\n\n\nint\n32\n-231\n231-1\nFrom +2,147,483,647 to -2,147,483,648\nint i = 65;\n\n\nlong\n64\n-263\n263-1\nFrom +9,223,372,036,854,775,807 to -9,223,372,036,854,775,808\nlong l = 65L;\n\n\nFloating-point\nfloat\n32\n2-149\n(2-2-23)2127\nFrom 3.402,823,5E+38 to 1.4E-45\nfloat f = 65f;\n\n\ndouble\n64\n2-1074\n(2-2-52)21023\nFrom 1.797,693,134,862,315,7E+308 to 4.9E-324\ndouble d = 65.55;\n\n\nOther\nboolean\n1\n--\n--\nfalse, true\nboolean b = true;\n\n\nvoid\n--\n--\n--\n--\n--Integer primitive types silently overflow:Code section 3.52: Several operators.\n\n\n1 int i = Integer.MAX_VALUE;\n2 System.out.println(i);\n3 i = i + 1;\n4 System.out.println(i);\n5 System.out.println(Integer.MIN_VALUE);\n\n\n\n\n\n\n\n\n\nConsole for Code section 3.52\n\n2147483647\n-2147483648\n-2147483648As Java is strongly typed, you can't assign a floating point number (a number with a decimal point) to an integer variable:Code section 3.53: Setting a floating point number as a value to an int (integer) type.\n\n\n1 int age;\n2 age = 10.5;A primitive type should be set by an appropriate value. The primitive types can be initialized with a literal. Most of the literals are primitive type values, except String Literals, which are instance of the String class."
}